jgressmann/tinyusb/src/portable/st/stm32_fsdev/dcd_stm32_fsdev32.c
  return true;
}
#endif

/**
  * @brief Copy a buffer from packet memory area (PMA) to user memory area.
  *        Uses byte-access of system memory and 16-bit access of packet memory
  * @param   wNBytes no. of bytes to be copied.
  * @retval None
  */
static bool dcd_read_packet_memory(void *__restrict dst, uint16_t src, size_t wNBytes)
{
  uint32_t n = (uint32_t)wNBytes >> 1U;
  uint32_t i;
  // The GCC optimizer will combine access to 32-bit sizes if we let it. Force
  // it volatile so that it won't do that.
  __IO const uint16_t *pdwVal;
  uint32_t temp;

  pdwVal = &pma[PMA_STRIDE*(src>>1)];
  uint8_t *dstVal = (uint8_t*)dst;

  for (i = n; i != 0U; i--)
  {
    temp = *pdwVal;
    pdwVal += PMA_STRIDE;
    *dstVal++ = ((temp >> 0) & 0xFF);
    *dstVal++ = ((temp >> 8) & 0xFF);
  }

  if (wNBytes % 2)
  {
    temp = *pdwVal;
    pdwVal += PMA_STRIDE;
    *dstVal++ = ((temp >> 0) & 0xFF);
  }
  return true;
}

#if 0 // TODO support dcd_edpt_xfer_fifo API
/**
  * @brief Copy a buffer from user packet memory area (PMA) to FIFO.
  *        Uses byte-access of system memory and 16-bit access of packet memory
  * @param   wNBytes no. of bytes to be copied.
  * @retval None
  */

// THIS FUNCTION IS UNTESTED

static bool dcd_read_packet_memory_ff(tu_fifo_t * ff, uint16_t src, uint16_t wNBytes)
{
  // Since we copy into a ring buffer FIFO, a wrap might occur making it necessary to conduct two copies
  // Check for first linear part
  void * dst;
  uint16_t len = tu_fifo_get_linear_write_info(ff, 0, &dst, wNBytes);           // THIS FUNCTION CHANGED!!!!
  TU_VERIFY(len && dcd_read_packet_memory(dst, src, len));
  tu_fifo_advance_write_pointer(ff, len);

  // Check for wrapped part
  if (len < wNBytes)
  {
    // Get remaining wrapped length
    uint16_t len2 = tu_fifo_get_linear_write_info(ff, 0, &dst, wNBytes - len);
    TU_VERIFY(len2);

    // Update source pointer
    src += len;

    // Since PMA is accessed 16-bit wise we need to handle the case when a 16 bit value was split
    if (len % 2)    // If len is uneven there is a byte left to copy
    {
      uint32_t temp = pma[PMA_STRIDE*(src>>1)];
      *((uint8_t *)dst++) = ((temp >> 8) & 0xFF);
      src++;
      len2--;
    }

    TU_VERIFY(dcd_read_packet_memory(dst, src, len2));
    tu_fifo_advance_write_pointer(ff, len2);
  }

  return true;
}

#endif

#endif

